7767517
206 260
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 4 in0 1 2 3 4
Input                    in1                      0 1 in1
Split                    splitncnn_1              1 3 in1 6 7 8
Input                    in2                      0 1 in2
Split                    splitncnn_2              1 3 in2 10 11 12
Input                    in3                      0 1 in3
Split                    splitncnn_3              1 3 in3 14 15 16
Input                    in4                      0 1 in4
Split                    splitncnn_4              1 3 in4 18 19 20
Convolution              convrelu_0               1 1 4 21 0=64 1=7 11=7 12=1 13=2 14=3 2=1 3=2 4=3 5=1 6=9408 9=1
Split                    splitncnn_5              1 2 21 22 23
Pooling                  maxpool2d_73             1 1 23 24 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Split                    splitncnn_6              1 2 24 25 26
Convolution              convrelu_1               1 1 26 27 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_2               1 1 27 28 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_7                   1 1 28 29 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Convolution              conv_8                   1 1 25 30 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_0                    2 1 29 30 31 0=0
ReLU                     relu_77                  1 1 31 32
Split                    splitncnn_7              1 2 32 33 34
Convolution              convrelu_3               1 1 34 35 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_4               1 1 35 36 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_11                  1 1 36 37 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_1                    2 1 37 33 38 0=0
ReLU                     relu_80                  1 1 38 39
Split                    splitncnn_8              1 2 39 40 41
Convolution              convrelu_5               1 1 41 42 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_6               1 1 42 43 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_14                  1 1 43 44 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_2                    2 1 44 40 45 0=0
ReLU                     relu_83                  1 1 45 46
Split                    splitncnn_9              1 3 46 47 48 49
Convolution              convrelu_7               1 1 49 50 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Convolution              convrelu_8               1 1 50 51 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Convolution              conv_17                  1 1 51 52 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Convolution              conv_18                  1 1 48 53 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072
BinaryOp                 add_3                    2 1 52 53 54 0=0
ReLU                     relu_86                  1 1 54 55
Split                    splitncnn_10             1 2 55 56 57
Convolution              convrelu_9               1 1 57 58 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_10              1 1 58 59 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_21                  1 1 59 60 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_4                    2 1 60 56 61 0=0
ReLU                     relu_89                  1 1 61 62
Split                    splitncnn_11             1 2 62 63 64
Convolution              convrelu_11              1 1 64 65 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_12              1 1 65 66 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_24                  1 1 66 67 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_5                    2 1 67 63 68 0=0
ReLU                     relu_92                  1 1 68 69
Split                    splitncnn_12             1 2 69 70 71
Convolution              convrelu_13              1 1 71 72 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_14              1 1 72 73 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_27                  1 1 73 74 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_6                    2 1 74 70 75 0=0
ReLU                     relu_95                  1 1 75 76
Split                    splitncnn_13             1 3 76 77 78 79
Convolution              convrelu_15              1 1 79 80 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Convolution              convrelu_16              1 1 80 81 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824 9=1
Convolution              conv_30                  1 1 81 82 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Convolution              conv_31                  1 1 78 83 0=1024 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=524288
BinaryOp                 add_7                    2 1 82 83 84 0=0
ReLU                     relu_98                  1 1 84 85
Split                    splitncnn_14             1 2 85 86 87
Convolution              convrelu_17              1 1 87 88 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_18              1 1 88 89 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_34                  1 1 89 90 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_8                    2 1 90 86 91 0=0
ReLU                     relu_101                 1 1 91 92
Split                    splitncnn_15             1 2 92 93 94
Convolution              convrelu_19              1 1 94 95 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_20              1 1 95 96 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_37                  1 1 96 97 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_9                    2 1 97 93 98 0=0
ReLU                     relu_104                 1 1 98 99
Split                    splitncnn_16             1 2 99 100 101
Convolution              convrelu_21              1 1 101 102 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_22              1 1 102 103 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_40                  1 1 103 104 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_10                   2 1 104 100 105 0=0
ReLU                     relu_107                 1 1 105 106
Split                    splitncnn_17             1 2 106 107 108
Convolution              convrelu_23              1 1 108 109 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_24              1 1 109 110 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_43                  1 1 110 111 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_11                   2 1 111 107 112 0=0
ReLU                     relu_110                 1 1 112 113
Split                    splitncnn_18             1 2 113 114 115
Convolution              convrelu_25              1 1 115 116 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_26              1 1 116 117 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_46                  1 1 117 118 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_12                   2 1 118 114 119 0=0
ReLU                     relu_113                 1 1 119 120
Split                    splitncnn_19             1 2 120 121 122
Convolution              convrelu_27              1 1 122 123 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Convolution              convrelu_28              1 1 123 124 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              conv_49                  1 1 124 125 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576
Convolution              conv_50                  1 1 121 126 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2097152
BinaryOp                 add_13                   2 1 125 126 127 0=0
ReLU                     relu_116                 1 1 127 128
Split                    splitncnn_20             1 2 128 129 130
Convolution              convrelu_29              1 1 130 131 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576 9=1
Convolution              convrelu_30              1 1 131 132 0=512 1=3 11=3 12=2 13=1 14=2 2=2 3=1 4=2 5=1 6=2359296 9=1
Convolution              conv_53                  1 1 132 133 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576
BinaryOp                 add_14                   2 1 133 129 134 0=0
ReLU                     relu_119                 1 1 134 135
Split                    splitncnn_21             1 2 135 136 137
Convolution              convrelu_31              1 1 137 138 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576 9=1
Convolution              convrelu_32              1 1 138 139 0=512 1=3 11=3 12=2 13=1 14=2 2=2 3=1 4=2 5=1 6=2359296 9=1
Convolution              conv_56                  1 1 139 140 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576
BinaryOp                 add_15                   2 1 140 136 141 0=0
ReLU                     relu_122                 1 1 141 142
Split                    splitncnn_22             1 2 142 143 144
Convolution              convrelu_33              1 1 144 145 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Pooling                  gap_0                    1 1 143 146 0=1 4=1
Convolution              convsigmoid_39           1 1 146 147 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=524288 9=4
Reshape                  reshape_142              1 1 147 148 0=1 1=1 2=-1
BinaryOp                 mul_16                   2 1 145 148 149 0=2
Pooling                  avgpool2d_1              1 1 3 150 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=0 6=0
Split                    splitncnn_23             1 2 150 151 152
Pooling                  avgpool2d_2              1 1 152 153 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=0 6=0
Split                    splitncnn_24             1 2 153 154 155
Pooling                  avgpool2d_3              1 1 155 156 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=0 6=0
Slice                    split_0                  1 2 149 157 158 -23300=2,128,-233 1=0
Split                    splitncnn_25             1 2 158 159 160
Concat                   cat_0                    2 1 159 18 161 0=0
Convolution              convsigmoid_40           1 1 161 162 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=4
Slice                    split_1                  1 2 162 163 164 -23300=2,128,-233 1=0
Split                    splitncnn_26             1 2 164 165 166
BinaryOp                 mul_17                   2 1 163 19 167 0=2
Concat                   cat_1                    2 1 160 167 168 0=0
Convolution              conv_60                  1 1 168 169 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
TanH                     tanh_134                 1 1 169 170
BinaryOp                 mul_18                   2 1 165 170 171 0=2
BinaryOp                 sub_19                   1 1 166 172 0=7 1=1 2=1.000000e+00
BinaryOp                 mul_20                   2 1 172 20 173 0=2
BinaryOp                 add_21                   2 1 173 171 174 0=0
Split                    splitncnn_27             1 2 174 175 out5
Concat                   cat_2                    2 1 157 175 177 0=0
Interp                   upsample_138             1 1 177 178 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_3                    3 1 178 77 156 179 0=0
Convolution              convrelu_34              1 1 179 180 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=888192 9=1
Slice                    split_2                  1 2 180 181 182 -23300=2,64,-233 1=0
Split                    splitncnn_28             1 2 182 183 184
Concat                   cat_4                    2 1 183 14 185 0=0
Convolution              convsigmoid_41           1 1 185 186 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=4
Slice                    split_3                  1 2 186 187 188 -23300=2,64,-233 1=0
Split                    splitncnn_29             1 2 188 189 190
BinaryOp                 mul_22                   2 1 187 15 191 0=2
Concat                   cat_5                    2 1 184 191 192 0=0
Convolution              conv_63                  1 1 192 193 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
TanH                     tanh_135                 1 1 193 194
BinaryOp                 mul_23                   2 1 189 194 195 0=2
BinaryOp                 sub_24                   1 1 190 196 0=7 1=1 2=1.000000e+00
BinaryOp                 mul_25                   2 1 196 16 197 0=2
BinaryOp                 add_26                   2 1 197 195 198 0=0
Split                    splitncnn_30             1 2 198 199 out4
Concat                   cat_6                    2 1 181 199 201 0=0
Interp                   upsample_139             1 1 201 202 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    3 1 202 47 154 203 0=0
Convolution              convrelu_35              1 1 203 204 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=222912 9=1
Slice                    split_4                  1 2 204 205 206 -23300=2,32,-233 1=0
Split                    splitncnn_31             1 2 206 207 208
Concat                   cat_8                    2 1 207 10 209 0=0
Convolution              convsigmoid_42           1 1 209 210 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=4
Slice                    split_5                  1 2 210 211 212 -23300=2,32,-233 1=0
Split                    splitncnn_32             1 2 212 213 214
BinaryOp                 mul_27                   2 1 211 11 215 0=2
Concat                   cat_9                    2 1 208 215 216 0=0
Convolution              conv_66                  1 1 216 217 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
TanH                     tanh_136                 1 1 217 218
BinaryOp                 mul_28                   2 1 213 218 219 0=2
BinaryOp                 sub_29                   1 1 214 220 0=7 1=1 2=1.000000e+00
BinaryOp                 mul_30                   2 1 220 12 221 0=2
BinaryOp                 add_31                   2 1 221 219 222 0=0
Split                    splitncnn_33             1 2 222 223 out3
Concat                   cat_10                   2 1 205 223 225 0=0
Interp                   upsample_140             1 1 225 226 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_11                   3 1 226 22 151 227 0=0
Convolution              convrelu_36              1 1 227 228 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=37728 9=1
Slice                    split_6                  1 2 228 229 230 -23300=2,16,-233 1=0
Split                    splitncnn_34             1 2 230 231 232
Concat                   cat_12                   2 1 231 6 233 0=0
Convolution              convsigmoid_43           1 1 233 234 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=4
Slice                    split_7                  1 2 234 235 236 -23300=2,16,-233 1=0
Split                    splitncnn_35             1 2 236 237 238
BinaryOp                 mul_32                   2 1 235 7 239 0=2
Concat                   cat_13                   2 1 232 239 240 0=0
Convolution              conv_69                  1 1 240 241 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
TanH                     tanh_137                 1 1 241 242
BinaryOp                 mul_33                   2 1 237 242 243 0=2
BinaryOp                 sub_34                   1 1 238 244 0=7 1=1 2=1.000000e+00
BinaryOp                 mul_35                   2 1 244 8 245 0=2
BinaryOp                 add_36                   2 1 245 243 246 0=0
Split                    splitncnn_36             1 2 246 247 out2
Concat                   cat_14                   2 1 229 247 249 0=0
Interp                   upsample_141             1 1 249 250 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_15                   2 1 250 1 251 0=0
Convolution              convrelu_37              1 1 251 252 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5040 9=1
Convolution              convrelu_38              1 1 252 253 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              conv_72                  1 1 253 254 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Slice                    split_8                  1 2 254 255 256 -23300=2,3,1 1=0
BinaryOp                 add_37                   2 1 255 2 257 0=0
Clip                     clamp_143                1 1 257 out0 0=0.000000e+00 1=1.000000e+00
Clip                     clamp_144                1 1 256 out1 0=0.000000e+00 1=1.000000e+00
